TexasInstruments/c2000ware-core-sdk/libraries/communications/usb/f2807x/source/usbmode.c
        g_eOTGModeState = eUSBOTGModeWait;
    }
}

//*****************************************************************************
//
//! This function is the main routine for the OTG Controller Driver.
//!
//! \param ui32MsTicks is the number of milliseconds that have passed since the
//! last time this function was called.
//!
//! This function is the main routine for the USB controller when using the
//! library in OTG mode.  This routine must be called periodically by the main
//! application outside of a callback context.  The \e ui32MsTicks value is
//! used for basic timing needed by the USB library when operating in OTG mode.
//! This allows for a simple cooperative system to access the the OTG
//! controller driver interface without the need for an RTOS.  All time
//! critical operations are handled in interrupt context but all longer
//! operations are run from the this function to allow them to block and wait
//! for completion without holding off other interrupts.
//!
//! \return None.
//
//*****************************************************************************
void
USBOTGMain(uint32_t ui32MsTicks)
{
    tEventInfo sEvent;

    if(ui32MsTicks > g_ui32WaitTicks)
    {
        g_ui32WaitTicks = 0;
    }
    else
    {
        g_ui32WaitTicks -= ui32MsTicks;
    }

    switch(g_eOTGModeState)
    {
        case eUSBOTGModeIdle:
        {
            g_eOTGModeState = eUSBOTGModeWaitID;

            //
            // Initiate a session request and check the ID pin.
            //
            USBOTGSessionRequest(USB_BASE, true);
            break;
        }
        case eUSBOTGModeWait:
        case eUSBOTGModeWaitID:
        {
            //
            // If reached the timeout and polling is enabled then look again.
            //
            if((g_ui32WaitTicks == 0) && (g_ui32PollRate != 0))
            {
                //
                // Remove the session request.
                //
                USBOTGSessionRequest(USB_BASE, false);

                //
                // Return to idle mode.
                //
                USBOTGSetMode(eUSBModeNone);

                //
                // Check if the controller is automatically applying power or
                // not.
                //
                if(USBHCDPowerAutomatic(0) == 0)
                {
                    //
                    // Call the registered event driver to allow it to disable
                    // power.
                    //
                    sEvent.ui32Event = USB_EVENT_POWER_DISABLE;
                    sEvent.ui32Instance = 0;
                    InternalUSBHCDSendEvent(0, &sEvent, USBHCD_EVFLAG_PWRDIS);
                }

                //
                // Go back to the idle state.
                //
                g_eOTGModeState = eUSBOTGModeIdle;
            }
            break;
        }
        case eUSBOTGModeAHost:
        {
            //
            // Call the host main routine when acting as a host.
            //
            USBHCDMain();
            break;
        }
        case eUSBOTGModeBWaitCon:
        case eUSBOTGModeBDevice:
        default:
        {
            break;
        }
    }
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
